# PointCloudFilter Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointCloudFilter Members
PointCloudFilter Class Methods Properties See Also
---
The PointCloudFilter type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering. |
| Dispose | Releases all resources used by the PointCloudFilter |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| PrepareForCell | Informs the filter that a series of points within a given cell is about to be checked. |
| TestCell | Checks whether a given cell, i.e. a box aligned with the XYZ axes, is inside, outside or on the border of the volume of interest. |
| TestPoint | Checks if a point is inside the volume of interest. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
PointCloudFilter Class
Autodesk.Revit.DB.PointClouds Namespace